Revit 2027 API
PanelScheduleData.SummaryShowsOnlyConnectedLoads Property
 Show only the connected load classifications in the summary section
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool SummaryShowsOnlyConnectedLoads { get; set; }
Public Property SummaryShowsOnlyConnectedLoads As Boolean
	Get
	Set
public:
property bool SummaryShowsOnlyConnectedLoads {
	bool get ();
	void set (bool value);
}
member SummaryShowsOnlyConnectedLoads : bool with get, set
Property Value
Boolean
See Also
Reference
PanelScheduleData Class
Autodesk.Revit.DB.Electrical Namespace